Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh1-6-v3.tmx
Source language: bo
Languages: en

source: བཙུན་པ་འདི་ལྟ་བུ་ནི་བདག་ལ་མས་མ་བགྱིས་ཏེ། ཕས་མ་ལགས་སྡུག་པས་མ་ལགས་རང་གི་སྐྱེ་བོ་དང་གཉེན་གྱི་ཚོགས་ཀྱིས་མ་ལགས། རྒྱལ་པོས་མ་ལགས་ལྷ་རྣམས་ཀྱིས་མ་ལགས། སྔ་མ་འདས་པ་རྣམས་ཀྱིས་མ་ལགས། དགེ་སྦྱོང་དང་བྲམ་ཟེ་རྣམས་ཀྱིས་མ་ལགས་པ་གང་ལགས་པ་དེ་བཅོམ་ལྡན་འདས་ཀྱིས་བདག་ལ་མཛད་དེ།
en: “O Honored One, what the Blessed One has done for me is what has never been done for me by my mother, father, wife, kinsmen and relatives, a king, gods, ancestral spirits, śramaṇas, or brahmins.

source: སེམས་ཅན་དམྱལ་བ་དང་དུད་འགྲོ་དང་། ཡི་དགས་རྣམས་ནས་ནི་རྐང་པ་དྲངས། ལྷ་དང་མི་རྣམས་ལ་ནི་རབ་ཏུ་བཞག །འཁོར་བ་ལས་ནི་རིང་དུ་མཛད། ཁྲག་དང་། མཆི་མའི་རྒྱ་མཚོ་ནི་བསྐམས། རུས་པའི་རི་བོ་ལས་ནི་བསྒྲལ། །ནང་སོང་གི་སྒོ་རྣམས་ནི་བཀུམ།
en: You have pulled me out from the states of hell, animals, and hungry ghosts, placed me among the gods and humans, caused me to leave the course of rebirth far behind, dried up the ocean of blood and tears, liberated me from the mountain of bones, shut the gate to inferior states of existence, and opened the gate to heaven and liberation.

source: མཐོ་རིས་དང་ཐར་པའི་སྒོ་རྣམས་ནི་ཕྱེ། ཐོག་མ་མེད་པའི་དུས་ནས་བསགས་པའི་འཇིག་ཚོགས་ལ་ལྟ་བའི་རིའི་རྩེ་མོ་ཉི་ཤུ་མཐོ་བ་ཡེ་ཤེས་ཀྱི་རྡོ་རྗེས་བཅོམ་ནས་རྒྱུན་དུ་ཞུགས་པའི་འབྲས་བུ་མངོན་སུམ་དུ་བགྱིས་ལགས་ཏེ།
en: With the vajra of knowledge I have leveled the twenty high peaks of the mountain chain of the false view of individuality that had been accumulated since beginningless time, and actualized the fruit of stream-entry.

source: བཙུན་པ་བདག་ནི་འཕགས་སོ། །མངོན་པར་འཕགས་སོ།
en: O Honored One, I have been exalted, truly exalted.

source: །བདག་བཅོམ་ལྡན་འདས་དང་ཆོས་དང་དགེ་སློང་གི་དགེ་འདུན་ལ་སྐྱབས་སུ་མཆི་ལགས་ཀྱིས་བདག་དགེ་བསྙེན་དུ་གཟུང་དུ་གསོལ།
en: Since I seek refuge in the Blessed One, the Dharma, and the community of monks, please accept me as a lay brother.

source: དེང་སླན་ཆད་ཇི་སྲིད་འཚོ་བའི་བར་དུ་སྲོག་དང་ཡང་བསྡོས་ཏེ་སྐྱབས་སུ་མཆི་བར་མངོན་པར་དད་ལགས་སོ།
en: From today onward, I embrace my faith as one who seeks refuge throughout my life.”

source: །དེ་ནས་སྔོན་ནེ་ཙོ་བྱེད་པའི་ལྷའི་བུ་བཅོམ་ལྡན་འདས་ཀྱིས་གསུངས་པ་ལ་མངོན་པར་དགའ་ཞིང་རྗེས་སུ་ཡི་རངས་ནས་ཚོང་པ་ཟོང་རྙེད་པ་ལྟ་བུ་དང་། ཞིང་པ་ལོ་ཏོག་ལེགས་པ་ལྟ་བུ་དང་། དཔའ་བོ་གཡུལ་ངོར་རྒྱལ་བ་ལྟ་བུ་དང་། ནད་པ་ནད་ཐམས་ཅད་ལས་ཡོངས་སུ་ཐར་བ་བཞིན་དུ་འབྱོར་པ་གང་གིས་བཅོམ་ལྡན་འདས་ཀྱི་སྤྱན་སྔར་འོངས་པའི་འབྱོར་པ་དེ་ཉིད་དང་རང་གི་གནས་སུ་སོང་ངོ་།
en: Thereupon the god who had once been the parrot rejoiced in and praised the words of the Blessed One. Like a merchant who had obtained merchandise, like a farmer who had gotten a bumper crop, like a warrior who had won a battle, like a patient who had been cured of every disease, he went to his house with the same majesty with which he had come into the presence of the Blessed One. VII. Vaiśālī A. The Visit of Āmrapālī

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོ་ལ་བཀའ་སྩལ་པ། ཀུན་དགའ་བོ་ཡངས་པ་ཅན་གང་ན་བ་དེར་འདོང་ངོ་།
en: Thereupon the Blessed One said to the venerable Ānanda, “Ānanda, let us go to Vaiśālī.”

source: དེ་ནས་བཅོམ་ལྡན་འདས་སྤོང་བྱེད་ནས་ལྗོངས་རྒྱུ་ཞིང་གཤེགས་པ་ན་ཡངས་པ་ཅན་དུ་བྱོན་ནས་ཡངས་པ་ཅན་གྱི་ཨ་མྲའི་ཚལ་ན་བཞུགས་སོ།
en: And so the Blessed One, traveling through the country of Vṛji, arrived in Vaiśālī, and he stayed in the mango grove in Vaiśālī.

source: །ཨ་མྲ་སྐྱོང་མས་བཅོམ་ལྡན་འདས་སྤོང་བྱེད་ནས་ལྗོངས་རྒྱུ་ཞིང་གཤེགས་པ་ན་ཡངས་པ་ཅན་དུ་བྱོན་ནས་ཡངས་པ་ཅན་གྱི་བདག་གི་ཨ་མྲའི་ཚལ་ཁོ་ན་ན་བཞུགས་སོ་ཞེས་ཐོས་སོ། །ཐོས་ནས་ཀྱང་རྒྱན་ཐམས་ཅད་ཀྱིས་བརྒྱན་ནས་བུད་མེད་ཀྱི་འཁོར་གྱིས་ཡོངས་སུ་བསྐོར་ཏེ། བཞོན་པ་བཟང་པོ་ལ་ཞོན་ནས་ཡངས་པ་ཅན་ནས་བྱུང་སྟེ། བཅོམ་ལྡན་འདས་ལ་བལྟ་བ་དང་བསྙེན་བཀུར་བྱ་བའི་ཕྱིར་བཅོམ་ལྡན་འདས་ཀྱི་སྤྱན་སྔར་སོང་སྟེ།
en: When Āmrapālī heard that the Blessed One, traveling through the country of Vṛji, had arrived in Vaiśālī and was staying in her own mango grove in Vaiśālī, she adorned herself with every ornament and, surrounded by her female attendants and riding a beautiful vehicle, left Vaiśālī and went to see and serve the Blessed One.

source: དེས་ཇི་ཙམ་བཞོན་པའི་སའི་བར་དུ་བཞོན་པས་སོང་ནས་བཞོན་པ་ལས་བབས་ཏེ་རྐང་པ་ཁོ་ནས་ཀུན་དགའ་ར་བར་ཞུགས་སོ།
en: Having gone as far as she could go by vehicle, she alighted from the vehicle and entered the park on foot.

source: །དེའི་ཚེ་བཅོམ་ལྡན་འདས་དགེ་སློང་གི་འཁོར་བརྒྱ་ཕྲག་དུ་མའི་གུང་ལ་ཆོས་འཆད་ཅིང་བཞུགས་པ་ན།
en: At that time the Blessed One was preaching the Dharma before a hundred monks.

source: བཅོམ་ལྡན་འདས་ཀྱིས་ཨ་མྲ་སྐྱོང་མ་རྒྱང་རིང་པོ་ཁོ་ན་ནས་གཟིགས་སོ།
en: The Blessed One saw Āmrapālī from a distance.

source: །གཟིགས་ནས་ཀྱང་ཡང་དགེ་སློང་རྣམས་ལ་བཀའ་སྩལ་པ། ཨ་མྲ་སྐྱོང་མ་ཕ་བི་འོང་གིས་བརྩོན་འགྲུས་དང་ཤེས་བཞིན་དང་དྲན་པ་དང་ལྡན་པས་གནས་པར་གྱིས་ཤིག །ངས་རྗེས་སུ་བསྟན་པ་ནི་འདི་ཡིན་ནོ།
en: When he saw her, the Blessed One said to the monks, “Since Āmrapālī is coming, abide with vigor, vigilance, and mindfulness. What I have taught is this:

source: །ཇི་ལྟར་ན་དགེ་སློང་བརྩོན་འགྲུས་ལ་གནས་པ་ཡིན་ཞེ་ན།
en: “How does a monk abide with vigor?

source: འདི་ལ་དགེ་སློང་གིས་སྡིག་པ་མི་དགེ་བའི་ཆོས་སྐྱེས་པ་རྣམས་སྤང་བའི་ཕྱིར་འདུན་པ་སྐྱེད་དོ་འབད་དོ་བརྩོན་འགྲུས་རྩོམ་མོ་སེམས་རབ་ཏུ་འཛིན་ཏོ་རབ་ཏུ་འཇོག་གོ།
en: Here a monk gives rise to diligence, endeavors, makes efforts, grasps his own mind, and exerts himself in order to abandon evil and nonvirtuous states that have arisen.

source: །སྡིག་པ་མི་དགེ་བའི་ཆོས་མ་སྐྱེས་པ་རྣམས་མི་བསྐྱེད་པའི་ཕྱིར་འདུན་པ་སྐྱེད་དོ་འབད་དོ་བརྩོན་འགྲུས་རྩོམ་མོ་སེམས་རབ་ཏུ་འཛིན་ཏོ་རབ་ཏུ་འཇོག་གོ།
en: He gives rise to diligence, endeavors, makes efforts, grasps his own mind, and exerts himself in order to prevent evil and nonvirtuous states that have not arisen from arising.

source: །དགེ་བའི་ཆོས་མ་སྐྱེས་པ་རྣམས་བསྐྱེད་པའི་ཕྱིར་འདུན་པ་སྐྱེད་དོ།
en: He gives rise to diligence, endeavors, makes efforts, grasps his own mind, and exerts himself in order to give rise to virtuous states that have not arisen.

source: །འབད་དོ་བརྩོན་འགྲུས་རྩོམ་མོ་སེམས་རབ་ཏུ་འཛིན་ཏོ་རབ་ཏུ་འཇོག་གོ། །དགེ་བའི་ཆོས་སྐྱེས་པ་རྣམས་གནས་པ་དང་ཉམས་པར་མི་འགྱུར་བ་དང་གོམས་པར་ཡོངས་སུ་རྫོགས་པར་བྱ་བ་དང་ཕྱིར་ཞིང་འབྱུང་བར་བྱ་བ་དང་། ཡེ་ཤེས་རྒྱ་ཆེན་པོ་མངོན་སུམ་དུ་བྱ་བའི་ཕྱིར་འདུན་པ་སྐྱེད་དོ་འབད་དོ། །བརྩོན་འགྲུས་རྩོམ་མོ། །སེམས་རབ་ཏུ་འཛིན་ཅིང་རབ་ཏུ་འཇོག་པ་སྟེ།
en: He gives rise to diligence, endeavors, makes efforts, grasps his own mind, and exerts himself in order to maintain virtuous states that have arisen, protect them from ruin, practice them, give rise to them again, and actualize vast wisdom.

source: དེ་ལྟར་ན་དགེ་སློང་བརྩོན་འགྲུས་ཅན་ཡིན་ནོ།
en: If so, that monk is called one who abides with vigor.

source: །ཇི་ལྟར་ན་དགེ་སློང་ཤེས་བཞིན་ཅན་ཡིན་ཞེ་ན།
en: “How does a monk possess vigilance?

source: འདི་ལ་དགེ་སློང་གིས་འགྲོ་བ་དང་། ལྡོག་པ་ལ་ཤེས་བཞིན་གྱིས་གནས་ཤིང་ལྟ་བ་དང་། རྣམ་པར་ལྟ་བ་དང་བསྐུམ་པ་དང་བརྐྱང་བ་དང་སྣམ་སྦྱར་དང་། ཆོས་གོས་དང་ལྷུང་བཟེད་ཐོགས་པ་དང་། འགྲོ་བ་དང་འགྲེང་བ་དང་། འདུག་པ་དང་ཉལ་བ་དང་། གཉིད་མ་ལོག་པ་དང་སྨྲ་བ་དང་མི་སྨྲ་བ་དང་། གཉིད་ཀྱིས་སྙོམ་པས་དུབ་པ་རྣམས་ལ་ཤེས་བཞིན་གྱིས་གནས་པ་སྟེ།
en: Here a monk abides with vigilance in his going back and forth. He abides with vigilance in his watching, observing, bending his body, stretching his body, holding his outer robe, robe, and bowl, walking, standing, sitting, lying down, not sleeping, talking, not talking, sleeping, being tired, and resting. If so, that monk is called one who possesses vigilance.

source: དེ་ལྟར་ན་དགེ་སློང་ཤེས་བཞིན་ཅན་ཡིན་ནོ། །ཇི་ལྟར་ན་དགེ་སློང་དྲན་པ་དང་ལྡན་པ་ཡིན་ཞེ་ན།
en: “How does a monk possess mindfulness?

source: འདི་ལ་དགེ་སློང་ནང་གི་ལུས་ལ་ལུས་ཀྱི་རྗེས་སུ་ལྟ་ཞིང་བརྩོན་འགྲུས་དང་། ཤེས་བཞིན་དང་དྲན་པ་དང་ལྡན་པས་འཇིག་རྟེན་ལ་གནོད་སེམས་དང་ཡིད་མི་བདེ་བ་སྤངས་ནས་གནས་སོ།
en: Here a monk, because he abides with vigor, vigilance, and mindfulness observing the inner body, has abandoned malice and despair toward the world. Because he abides with vigor, vigilance, and mindfulness observing the outer body and the inner and outer body;

source: །ཕྱིའི་ལུས་དང་ནང་དང་ཕྱིའི་ལུས་དང་། ནང་གི་ཚོར་བ་རྣམས་དང་ཕྱིའི་ཚོར་བ་རྣམས་དང་ནང་དང་ཕྱིའི་ཚོར་བ་རྣམས་དང་། ནང་གི་སེམས་དང་ཕྱིའི་སེམས་དང་ནང་དང་ཕྱིའི་སེམས་དང་། ནང་གི་ཆོས་རྣམས་དང་ཕྱིའི་ཆོས་རྣམས་དང་ནང་དང་ཕྱིའི་ཆོས་རྣམས་ལ་ཆོས་ཀྱི་རྗེས་སུ་ལྟ་ཞིང་བརྩོན་འགྲུས་དང་། ཤེས་བཞིན་དང་དྲན་པ་དང་ལྡན་པས་འཇིག་རྟེན་ལ་གནོད་སེམས་དང་ཡིད་མི་བདེ་བ་སྤངས་ནས་གནས་པ་སྟེ།
en: inner perceptions, outer perceptions, and inner and outer perceptions; the inner mind, the outer mind, and the inner and outer mind; and inner phenomena, outer phenomena, and inner and outer phenomena, he has abandoned malice and despair toward the world.

source: དེ་ལྟར་ན་དགེ་སློང་དྲན་པ་དང་ལྡན་པ་ཡིན་ནོ།
en: If so, that monk is called one who possesses mindfulness.

source: །དགེ་སློང་དག་ངས་ཨ་མྲ་སྐྱོང་མ་ཕ་བི་འོང་གིས་བརྩོན་འགྲུས་དང་། ཤེས་བཞིན་དང་དྲན་པ་དང་ལྡན་པས་གནས་པར་གྱིས་ཤིག །ངས་རྗེས་སུ་བསྟན་པ་ནི་འདི་ཡིན་ཞེས་ངས་གང་གསུངས་པ་བཤད་པ་ནི་དེ་ཡིན་ནོ།
en: “Monks, I said, ‘Since Āmrapālī is coming, abide with vigor, vigilance, and mindfulness. What I have taught is this.’ This is it.”

source: །དེ་ནས་ཨ་མྲ་སྐྱོང་མ་བཅོམ་ལྡན་འདས་གང་ན་བ་དེར་སོང་སྟེ་ཕྱིན་ནས་བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་གཉིས་ལ་མགོ་བོས་ཕྱག་བྱས་ཏེ་ཕྱོགས་གཅིག་ཏུ་འདུག་གོ།
en: Then Āmrapālī went to the Blessed One. When she arrived, she bowed low until her forehead touched the Blessed One’s feet, and then she sat down to one side.

source: །ཕྱོགས་གཅིག་ཏུ་འདུག་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་ཨ་མྲ་སྐྱོང་མ་ལ་ཆོས་དང་ལྡན་པའི་གཏམ་གྱིས་ཡང་དག་པར་སྟོན་པར་མཛད། ཡང་དག་པར་འཛིན་དུ་འཇུག་པར་མཛད། ཡང་དག་པར་གཟེངས་སྟོད་པར་མཛད། ཡང་དག་པར་རབ་ཏུ་དགའ་བར་མཛད་དེ།
en: When she had sat down, the Blessed One, through talk consistent with the Dharma, instructed, inspired, encouraged, and delighted Āmrapālī.

source: རྣམ་གྲངས་དུ་མར་ཆོས་དང་ལྡན་པའི་གཏམ་གྱིས་ཡང་དག་པར་བསྟན། ཡང་དག་པར་འཛིན་དུ་བཅུག །ཡང་དག་པར་གཟེངས་བསྟོད། ཡང་དག་པར་གཟེངས་བསྟོད། ཡང་དག་པར་རབ་ཏུ་དགའ་བར་མཛད་ནས་ཅང་མི་གསུང་ངོ་།
en: After he had instructed, inspired, encouraged, and delighted her in a variety of ways through talk consistent with the Dharma, the Blessed One remained silent.

source: །དེ་ནས་ཨ་མྲ་སྐྱོང་མ་སྟན་ལས་ལངས་ཏེ་བླ་གོས་ཕྲག་པ་གཅིག་ཏུ་གཟར་ནས་བཅོམ་ལྡན་འདས་གང་ན་བ་དེ་ལོགས་སུ་ཐལ་མོ་སྦྱར་བ་བཏུད་དེ། བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་དགེ་སློང་གི་དགེ་འདུན་དང་ཐབས་ཅིག་ཏུ་སང་བདག་གི་སྡུམ་པར་གདུགས་ཚོད་སྦྱོར་ཞིང་མཆིས་ན་གནང་བར་མཛད་དུ་གསོལ།
en: Then Āmrapālī rose from her seat, draped her upper robe over one shoulder, made the gesture of supplication to the Blessed One, and said to him, “May the Blessed One together with the community of monks assent to my offer of a meal at my house tomorrow.”

source: བཅོམ་ལྡན་འདས་ཀྱིས་ཨ་མྲ་སྐྱོང་མ་ལ་ཅང་མི་གསུང་བས་གནང་ངོ་།
en: The Blessed One assented to Āmrapālī by remaining silent.

source: །དེ་ནས་ཨ་མྲ་སྐྱོང་མས་བཅོམ་ལྡན་འདས་ཅང་མི་གསུང་བས་གནང་བར་རིག་ནས་བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་གཉིས་ལ་མགོ་བོས་ཕྱག་བྱས་ཏེ་བཅོམ་ལྡན་འདས་ཀྱི་སྤྱན་སྔ་ནས་སོང་ངོ་།
en: Then Āmrapālī, knowing that the Blessed One had assented by remaining silent, bowed low until her forehead touched the feet of the Blessed One, and departed from the Blessed One’s presence. B. The Visit of the Licchavis

source: །ཡངས་པ་ཅན་གྱི་ལིཙྪ་བཱི་རྣམས་ཀྱིས་བཅོམ་ལྡན་འདས་སྤོང་བྱེད་ནས་ལྗོངས་རྒྱུ་ཞིང་གཤེགས་པ་དང་ཡངས་པ་ཅན་དུ་ཕྱིན་ཏེ། ཡངས་པ་ཅན་གྱི་ཨ་མྲ་སྐྱོང་མའི་ཚལ་ན་བཞུགས་སོ་ཞེས་ཐོས་སོ། །ཐོས་ནས་ཀྱང་སོ་སོ་ནས་ཤིང་རྟ་དང་རྟ་རྣམས་ལ་ཞོན་ཏེ།
en: When the people of the Licchavi clan in Vaiśālī heard that the Blessed One, traveling through the country of Vṛji, had arrived in Vaiśālī and was staying in the grove of Āmrapālī in Vaiśālī, each of them mounted a chariot or a horse.

source: ཁ་ཅིག་ནི་རྟ་སྔོན་པོ་དང་། ཤིང་རྟ་སྔོན་པོ་དང་། སྲབ་སྐྱོགས་དང་། ལྕག་སྔོན་པོ་དང་། ཐོར་ཚུགས་དང་། གདུགས་དང་། རལ་གྲི་ཤུབས་སྔོན་པོ་དང་། རྔ་ཡབ་ནོར་བུའི་ཡུ་བ་ཅན་དང་། གོས་དང་། རྒྱན་དང་། བྱུག་པ་སྔོན་པོ་དང་། འཁོར་སྔོན་པོར།
en: Some of them prepared horses in blue; blue chariots; blue reins and whips; blue turbans, parasols, and sword sheaths; blue cowries with jeweled sticks, garments, ornaments, and ointments; and attendants in blue.

source: ཁ་ཅིག་ནི་རྟ་སེར་པོ་དང་། ཤིང་རྟ་སེར་པོ་དང་། སྲབ་སྐྱོགས་དང་། ལྕག་སེར་པོ་དང་། ཐོར་ཚུགས་དང་། གདུགས་དང་། རལ་གྲི་ཤུབས་སེར་པོ་དང་། རྔ་ཡབ་ནོར་བུའི་ཡུ་བ་ཅན་དང་། གོས་དང་། རྒྱན་དང་། བྱུག་པ་སེར་པོ་དང་། འཁོར་སེར་པོར།
en: Some of them prepared horses in yellow; yellow chariots; yellow reins and whips; yellow turbans, parasols, and sword sheaths; yellow cowries with jeweled sticks, garments, ornaments, and ointments; and attendants in yellow.

source: ཁ་ཅིག་ནི་རྟ་དམར་པོ་དང་། ཤིང་རྟ་དམར་པོ་དང་། སྲབ་སྐྱོགས་དང་། ལྕག་དམར་པོ་དང་། ཐོར་ཚུགས་དང་། གདུགས་དང་། རལ་གྲི་ཤུབས་དམར་པོ་དང་། རྔ་ཡབ་ནོར་བུའི་ཡུ་བ་ཅན་དང་། གོས་དང་། རྒྱན་དང་། བྱུག་པ་དམར་པོ་དང་། འཁོར་དམར་པོར།
en: Some of them prepared horses in red; red chariots; red reins and whips; red turbans, parasols, and sword sheaths; red cowries with jeweled sticks, garments, ornaments, and ointments; and attendants in red.

source: ཁ་ཅིག་ནི་རྟ་དཀར་པོ་དང་། ཤིང་རྟ་དཀར་པོ་དང་། སྲབ་སྐྱོགས་དང་། ལྕག་དཀར་པོ་དང་། ཐོར་ཚུགས་དང་། གདུགས་དང་། རལ་གྲི་ཤུབས་དཀར་པོ་དང་། རྔ་ཡབ་ནོར་བུའི་ཡུ་བ་ཅན་དང་། གོས་དང་། རྒྱན་དང་། བྱུག་པ་དཀར་པོ་དང་། འཁོར་དཀར་པོར་ཆས་ཏེ་སྐད་མཐོན་པོ་དང་། སྐད་ཆེན་པོར་སླར་ཁྱེར་སླར་ཁྱེར་ཅེས་ཟེར་ཞིང་ཡངས་པ་ཅན་ནས་བྱུང་སྟེ།
en: Some of them prepared horses in white; white chariots; white reins and whips; white turbans, parasols, and sword sheaths; white cowries with jeweled sticks, garments, ornaments, and ointments;

source: བཅོམ་ལྡན་འདས་ལ་བལྟ་བ་དང་བསྙེན་བཀུར་བྱ་བའི་ཕྱིར་བཅོམ་ལྡན་འདས་ཀྱི་སྤྱན་སྔར་དོང་ངོ་།
en: and attendants in white. They left Vaiśālī noisily, speaking loudly, and went to see and serve the Blessed One.

source: །བཅོམ་ལྡན་འདས་ཀྱིས་ཡངས་པ་ཅན་གྱི་ལིཙྪ་བཱི་རྣམས་རྒྱང་རིང་པོ་ཁོ་ན་ནས་འོང་བ་གཟིགས་སོ། །གཟིགས་ནས་ཀྱང་དགེ་སློང་རྣམས་ལ་བཀའ་སྩལ་པ། དགེ་སློང་དག་ཁྱེད་ཅག་ལས་སུས་སུམ་བཅུ་རྩ་གསུམ་པའི་ལྷ་རྣམས་སྐྱེད་མོས་ཚལ་གྱི་གནས་སུ་འགྲོ་བ་མ་མཐོང་བ་དེ་ཡངས་པ་ཅན་གྱི་ལིཙྪ་བཱི་རྣམས་ལ་ལྟོས་ཤིག །དེ་ཅིའི་ཕྱིར་ཞེ་ན།
en: When the Blessed One saw the people of the Licchavi clan in Vaiśālī coming from a distance, the Blessed One said to the monks, “Monks, those of you who have not seen the Thirty-Three Gods going to a park should look at the people of the Licchavi clan in Vaiśālī. Why?

source: དགེ་སློང་དག་སུམ་བཅུ་རྩ་གསུམ་པའི་ལྷ་རྣམས་ཀྱང་ཇི་ལྟར་ད་ལྟར་གྱི་ཡངས་པ་ཅན་གྱི་ལིཙྪ་བཱི་དག་བཞིན་དུ་རྫུ་འཕྲུལ་འདི་དང་། འབྱོར་པ་འདི་དང་། ཆ་ལུགས་འདིས་སྐྱེད་མོས་ཚལ་གྱི་གནས་སུ་འགྲོའོ།
en: Monks, the Thirty-Three Gods go to a park like these people of the Licchavi clan in Vaiśālī, with magical power like this, with majesty like this, and in vestments like these.”

source: །ཇི་ཙམ་བཞོན་པའི་སའི་བར་དུ་བཞོན་པས་སོང་ནས་བཞོན་པ་ལས་བབས་ཏེ་རྐང་པ་ཁོ་ནས་ཀུན་དགའི་ར་བར་ཞུགས་སོ།
en: Having gone as far as they could go by vehicle, they alighted from their vehicles and entered the park on foot.

source: །དེ་ནས་ཡངས་པ་ཅན་གྱི་ལིཙྪ་བཱི་རྣམས་བཅོམ་ལྡན་འདས་གང་ན་བ་དེར་དོང་སྟེ་ལྷགས་ནས་བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་མགོ་བོས་ཕྱག་བྱས་ཏེ་ཕྱོགས་གཅིག་ཏུ་འཁོད་དོ།
en: Then the people of the Licchavi clan in Vaiśālī went to the Blessed One. After they had gathered, they bowed low until their foreheads touched the Blessed One’s feet, and then they sat down to one side.

source: །ཕྱོགས་གཅིག་ཏུ་འཁོད་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་ཡངས་པ་ཅན་གྱི་ལིཙྪ་བཱི་རྣམས་ལ་ཆོས་དང་ལྡན་པའི་གཏམ་གྱིས་ཡང་དག་པར་སྟོན་པར་མཛད། ཡང་དག་པར་འཛིན་དུ་འཇུག་པར་མཛད། ཡང་དག་པར་གཟེངས་སྟོད་པར་མཛད། ཡང་དག་པར་རབ་ཏུ་དགའ་བར་མཛད་དེ།
en: When they had sat down to one side, the Blessed One, through talk consistent with the Dharma, instructed, inspired, encouraged, and delighted the people of the Licchavi clan in Vaiśālī.

source: རྣམ་གྲངས་དུ་མར་ཆོས་དང་ལྡན་པའི་གཏམ་གྱིས་ཡང་དག་པར་བསྟན། ཡང་དག་པར་འཛིན་དུ་བཅུག །ཡང་དག་པར་གཟེངས་བསྟོད། །ཡང་དག་པར་རབ་ཏུ་དགའ་བར་མཛད་ནས་ཅང་མི་གསུང་ངོ་།
en: After he had instructed, inspired, encouraged, and delighted them in a variety of ways through talk consistent with the Dharma, the Blessed One remained silent.

source: །དེའི་ཚེ་བྲམ་ཟེའི་ཁྱེའུ་སེར་སྐྱའི་བུ་འཁོར་འདུས་པ་དེ་ཉིད་དུ་འདུག་པར་གྱུར་ཏོ།
en: At that time, a young brahmin named Paiṅgika was sitting in the assembly.

source: །དེ་ནས་བྲམ་ཟེའི་ཁྱེའུ་སེར་སྐྱའི་བུ་སྟན་ལས་ལངས་ཏེ་བླ་གོས་ཕྲག་པ་གཅིག་ཏུ་གཟར་ནས་བཅོམ་ལྡན་འདས་གང་ན་བ་དེ་ལོགས་སུ་ཐལ་མོ་སྦྱར་བ་བཏུད་དེ། བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་བདག་ནི་སྤོབས་ལགས་སོ།
en: This young brahmin Paiṅgika rose from his seat, draped his upper robe over one shoulder, made the gesture of supplication to the Blessed One, and said to him, “Blessed One, I am inspired.

source: །བདེ་བར་གཤེགས་པ་བདག་ནི་སྤོབས་ལགས་སོ།
en: Sugata, I am inspired.”

source: །བཅོམ་ལྡན་འདས་ཀྱིས་སེར་སྐྱའི་བུ་ཁྱོད་སྤོབས་པར་གྱིས་ཤིག་ཅེས་བཀའ་སྩལ་པ་དང་། དེ་ནས་བྲམ་ཟེའི་ཁྱེའུ་སེར་སྐྱའི་བུས་དེའི་ཚེ་ཚིགས་སུ་བཅད་དེ་གསོལ་པ།
en: “Paiṅgika, speak of it,” said the Blessed One. The young brahmin Paiṅgika then spoke some verses:

source: ཨང་གའི་རྒྱལ་པོ་ནོར་བུའི་གོ་འཆང་བ།
en: “The king of Aṅga in jeweled armor,

source: །མ་གའི་དབང་པོས་རྙེད་པ་རབ་རྙེད་དེ།
en: The lord of Magadha has profited well.

source: །དེ་ཡི་ཡུལ་དུ་བྱུང་བའི་སངས་རྒྱས་ནི།
en: The Buddha, who appeared in his land,

source: །གྲགས་པའི་སྒྲ་དག་གངས་ཀྱི་རི་བོ་བཞིན།
en: Possesses fame like that of the Himalaya.

source: །ཇི་ལྟར་པད་མ་བཟང་པོ་ལེགས་འཁྲུངས་པ། །དགོངས་ཀ་ཁ་འབྱེ་དྲི་ཞིམ་ལྡན་པ་བཞིན།
en: “Like a well-grown lotus

source: །བར་སྣང་ལ་ནི་ཉི་མ་ལྷག་གེ་བར།
en: Blooming fragrantly in the evening,

source: །སྣང་བ་ལྟ་བུར་ཉི་མའི་རྒྱུད་ལ་ལྟོས།
en: Like the sun shining brightly in the sky, Look at the descendant of Aṅgiras.

source: །དེ་བཞིན་གཤེགས་པ་རྣམས་ཀྱི་ཤེས་རབ་སྟོབས།
en: “Look at the power of the wisdom of the tathāgatas,

source: །ཇི་ལྟར་མཚན་མོ་མེ་འབར་ལྟ་བུ་ལྟོས།
en: Which is like a fire burning in the night.

source: །དེ་ནི་མིག་བྱེད་སྣང་བ་བྱེད་པ་སྟེ།
en: He opens our eyes, illuminates,

source: །ལྷགས་པ་རྣམས་ཀྱི་ཐེ་ཚོམ་རྣམ་པར་འདུལ།
en: And resolves the questions of those who approach him.”

source: །ལིཙྪ་བཱི་ལྔ་བརྒྱས་བྲམ་ཟེའི་ཁྱེའུ་སེར་སྐྱའི་བུ་ལེགས་པར་སྨྲས་སོ།
en: The five hundred Licchavis, saying, “The young brahmin Paiṅgika has spoken eloquently.

source: །བྲམ་ཟེའི་ཁྱེའུ་སེར་སྐྱའི་བུ་ལེགས་པར་སྨྲས་སོ། །ཞེས་བླ་གོས་ལྔ་བརྒྱ་ལེགས་པར་སྨྲས་པའི་ཕྱིར་བྱིན་ནོ།
en: The young brahmin Paiṅgika has spoken eloquently,” gave him five hundred upper robes for his eloquence.

source: །དེ་ནས་ཡངས་པ་ཅན་གྱི་ལིཙྪ་བཱི་རྣམས་སྟན་ལས་ལངས་ཏེ་བླ་གོས་ཕྲག་པ་གཅིག་ཏུ་གཟར་ནས་བཅོམ་ལྡན་འདས་གང་ན་བ་དེ་ལོགས་སུ་ཐལ་མོ་སྦྱར་བ་བཏུད་དེ་བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་དགེ་སློང་གི་དགེ་འདུན་དང་ཐབས་ཅིག་ཏུ་སང་བདག་གི་སྡུམ་པར་གདུགས་ཚོད་སྦྱོར་ཞིང་མཆིས་ན་གནང་བར་མཛད་དུ་གསོལ།
en: The people of the Licchavi clan in Vaiśālī then rose from their seats, draped their upper robes over one shoulder, made the gesture of supplication to the Blessed One, and said to him, “May the Blessed One together with the community of monks assent to our offer of a meal at our house tomorrow.”

source: །གནས་འཇོག་དག་ང་སྔར་ཨ་མྲ་སྐྱོང་མས་སྤྱན་དྲངས་སོ།
en: “Vāsiṣṭhas, I have already been invited by Āmrapālī.”

source: །བཙུན་པ་ཨ་མྲ་སྐྱོང་མ་དམན་པ་ཤེས་རབ་དམན་པ་དེས་བདག་ཅག་བསླུས་ལགས་ཏེ།
en: “Honored One, we have been defeated by that lowly, dimwitted Āmrapālī.

source: དེས་ན་བདག་ཅག་གིས་བཅོམ་ལྡན་འདས་ཐོག་མ་ཉིད་དུ་བལྟ་བ་དང་། བསྙེན་བཀུར་བགྱིད་ཅིང་མཆི་བའི་རྔོ་མ་ཐོག་མོད་ཀྱི་ད་དུང་ཡང་བདག་ཅག་བཅོམ་ལྡན་འདས་དང་དགེ་སློང་གི་དགེ་འདུན་ལ་བསྙེན་བཀུར་འཚལ་ལོ།
en: And so, though we were unable to come to see and serve the Blessed One first, we will again offer service to the Blessed One and the community of monks.”

source: །བཅོམ་ལྡན་འདས་ཀྱིས་དེ་དག་ལ་གནས་འཇོག་དེ་ནི་ལེགས་པར་སྨྲས་སོ་ཞེས་བཀའ་སྩལ་ཏོ། །དེ་ནས་ཡངས་པ་ཅན་གྱི་ལིཙྪ་བཱི་རྣམས་བཅོམ་ལྡན་འདས་ཀྱིས་གསུངས་པ་ལ་མངོན་པར་དགའ་སྟེ་རྗེས་སུ་ཡི་རངས་ནས།
en: The Blessed One said to them, “Vāsiṣṭhas, it is good that you have said this.” Thereupon the people of the Licchavi clan in Vaiśālī rejoiced in and praised the words of the Blessed One.

source: བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་གཉིས་ལ་མགོ་བོས་ཕྱག་བྱས་ཏེ་བཅོམ་ལྡན་འདས་ཀྱི་སྤྱན་སྔ་ནས་དོང་ངོ་།
en: They bowed low until their foreheads touched the Blessed One’s feet, and they departed from the Blessed One’s presence.

source: །བྲམ་ཟེའི་ཁྱེའུ་སེར་སྐྱའི་བུ་ནི་དེ་ཉིད་ན་འདུག་གོ།
en: The young brahmin Paiṅgika remained seated there.

source: །དེ་ནས་བྲམ་ཟེའི་ཁྱེའུ་སེར་སྐྱའི་བུས་ཡངས་པ་ཅན་གྱི་ལིཙྪ་བཱི་རྣམས་དོང་ནས་རིང་པོ་མ་ལོན་པར་ཤེས་ནས་སྟན་ལས་ལངས་ནས་བླ་གོས་ཕྲག་པ་གཅིག་ཏུ་གཟར་ནས་བཅོམ་ལྡན་འདས་གང་ན་བ་དེ་ལོགས་སུ་ཐལ་མོ་སྦྱར་བ་བཏུད་དེ། བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཙུན་པ་འདིར་བདག་ལ་ལིཙྪ་བཱི་ལྔ་བརྒྱས་བླ་གོས་ལྔ་བརྒྱ་ལེགས་པར་སྨྲས་པའི་ཕྱིར་སྩལ་བ་འདི་དག་བཅོམ་ལྡན་འདས་ཀྱིས་ཐུགས་བརྩེ་བ་ཉེ་བར་བཟུང་སྟེ་བཞེས་སུ་གསོལ།
en: As soon as the people of the Licchavi clan in Vaiśālī had left, the young brahmin Paiṅgika then rose from his seat, draped his upper robe over one shoulder, made the gesture of supplication to the Blessed One, and said to him, “O Honored One, here the five hundred Licchavis have given me five hundred upper robes for my eloquence.

source: བཅོམ་ལྡན་འདས་ཀྱིས་བྲམ་ཟེའི་ཁྱེའུ་སེར་སྐྱའི་བུ་ལ་ཐུགས་བརྩེ་བ་ཉེ་བར་བཟུང་སྟེ་བླ་གོས་ལྔ་བརྒྱ་བཞེས་སོ།
en: May the Blessed One have compassion for me and accept the robes.” The Blessed One had compassion for the young brahmin Paiṅgika and accepted the five hundred upper robes.

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་བྲམ་ཟེའི་ཁྱེའུ་སེར་སྐྱའི་བུ་ལ་བཀའ་སྩལ་པ། དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འཇིག་རྟེན་དུ་བྱུང་ན་ངོ་མཚར་རྨད་དུ་བྱུང་བའི་ཆོས་རྣམ་པ་ལྔ་འཇིག་རྟེན་དུ་འབྱུང་བར་འགྱུར་ཏེ། ལྔ་གང་ཞེ་ན། སེར་སྐྱའི་བུ་འདི་ལ་སྟོན་པ་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རིག་པ་དང་ཞབས་སུ་ལྡན་པ།
en: Thereupon the Blessed One said to the young brahmin Paiṅgika, “When a tathāgata, an arhat, a perfectly awakened one appears in the world, five wonders and marvels will appear in the world. What are the five?

source: བདེ་བར་གཤེགས་པ། འཇིག་རྟེན་མཁྱེན་པ། སྐྱེས་བུ་འདུལ་བའི་ཁ་ལོ་སྒྱུར་བ་བླ་ན་མེད་པ། ལྷ་དང་མི་རྣམས་ཀྱི་སྟོན་པ། སངས་རྒྱས་བཅོམ་ལྡན་འདས་འཇིག་རྟེན་དུ་འབྱུང་ཞིང་དེ་ཆོས་ཐོག་མར་དགེ་བ།
en: “Paiṅgika, here in the world there appears a teacher who is a tathāgata, an arhat, a perfectly awakened one, perfect in knowledge and conduct, a sugata, world knowing, a supreme tamer of people to be tamed, a teacher of gods and humans, a buddha, and a blessed one.

source: བར་དུ་དགེ་བ་ཐ་མར་དགེ་བ། དོན་བཟང་པོ། ཚིག་འབྲུ་བཟང་པོ་མ་འདྲེས་པ། ཡོངས་སུ་རྫོགས་པ། ཡོངས་སུ་དག་པ།
en: He will teach Dharma that is good in the beginning, good in the middle, good at the end, excellent in meaning, excellent in wording, distinct, complete, pure, and immaculate, teaching the pure life.

source: ཡོངས་སུ་བྱང་བ། ཚངས་པར་སྤྱོད་པ་སྟོན་པར་འགྱུར་ཏེ། སེར་སྐྱའི་བུ་འདི་ནི་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འཇིག་རྟེན་དུ་བྱུང་ན་ངོ་མཚར་རྨད་དུ་བྱུང་བའི་ཆོས་འཇིག་རྟེན་དུ་འབྱུང་བ་དང་པོ་ཡིན་ནོ།
en: Paiṅgika, this is the first wonder and marvel that appears in the world when a tathāgata, an arhat, a perfectly awakened one appears in the world.

source: །གང་དག་ཆོས་དེ་ཞེ་ས་དང་བཅས་པས་ཉན་ཅིང་བླ་མར་བྱེད། དམ་པར་བྱེད།
en: “Some people listen to the Dharma with respect, look up to it, revere it, incline their ears to it attentively while concentrating their minds, and listen to it while focusing their entire mind.

source: ཡིད་ལ་བྱེད་ཅིང་སེམས་རྩེ་གཅིག་ཏུ་རྣ་བླགས་ནས་སེམས་ཐམས་ཅད་བསྡུས་ནས་ཉན་པར་བྱེད་པ་འདི་ནི་སེར་སྐྱའི་བུ་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འཇིག་རྟེན་དུ་བྱུང་ན་ངོ་མཚར་རྨད་དུ་བྱུང་བའི་ཆོས་འཇིག་རྟེན་དུ་འབྱུང་བ་གཉིས་པ་ཡིན་ནོ།
en: Paiṅgika, this is the second wonder and marvel that appears in the world when a tathāgata, an arhat, a perfectly awakened one appears in the world.

source: །ཆོས་དེ་གང་དག་གིས་ཐོས་ནས་དེ་ལྟ་དེ་ལྟར་སྒྲུབ་པར་བྱེད་པ་འདི་ནི་སེར་སྐྱའི་བུ་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འཇིག་རྟེན་དུ་བྱུང་ན་ངོ་མཚར་རྨད་དུ་བྱུང་བའི་ཆོས་འཇིག་རྟེན་དུ་འབྱུང་བ་གསུམ་པ་ཡིན་ནོ།
en: “Having listened to the Dharma, some people accomplish the Dharma according to how they have heard it. Paiṅgika, this is the third wonder and marvel that appears in the world when a tathāgata, arhat, perfectly awakened one appears in the world.
